{
    "tasks": {
        "1": {
            "description": "Значение выражения 7^103 + 20∙7^104 – 3∙7^57 + 97 записали в системе счисления с основанием 7. Сколько цифр 6 содержится в этой записи?",
            "expected_output": "48"
        },
        "2": {
            "description": "Значение выражения 7^103 + 6∙7^104 – 3∙7^57 + 98 записали в системе счисления с основанием 7. Найдите сумму цифр получишегося числа в 10 с.с.",
            "expected_output": "282"
        }
		,
        "3": {
            "description": "Значение выражения 6^203 + 5∙6^405 – 3∙6^144 + 76 записали в системе счисления с основанием 6. Найдите разницу в кол-ве пятерок и нулей.",
            "expected_output": "285"
        },
        "4": {
            "description": "Значение арифметического выражения 17^5 + 85^8 – 10 записали в системе счисления с основанием 17. В этой записи помимо цифр от 0 до 9 могут встречаться цифры из списка: А, B, С, D, E, F, G, которые имеют числовые значения от 10 до 16 соответственно. Сколько цифр G встречается в этой записи?",
            "expected_output": "5"
        },
        "5": {
            "description": "Значение арифметического выражения 7^2 + 49^4 - 21 записали в системе счисления с основанием 14. В этой записи помимо цифр от 0 до 9 могут встречаться цифры из списка: А, B, С, D, которые имеют числовые значения от 10 до 13 соответственно. Сколько цифр A и цифр 0 встречается в этой записи?",
            "expected_output": "3"
        },
        "6": {
            "description": "При каком наименьшем натуральном значении переменной x в выражении 81^20 – 9^x + 50 сумма цифр в девятеричной записи числа равна 138?",
            "expected_output": "24"
        },
        "7": {
            "description": "Значение выражения 64^12 – 8^14 + x записали в восьмеричной системе счисления, при этом в записи оказалось 12 цифр 7 и одна единица. При каком наименьшем натуральном x это возможно?",
            "expected_output": "127"
        },
        "8": {
            "description": "Операнды арифметического выражения записаны в системе счисления с основанием 18: 9009x₁₈ + 2257x₁₈ В записи чисел переменной x обозначена неизвестная цифра из алфавита 18-ричной системы счисления. Определите наименьшее значение x, при котором значение данного арифметического выражения кратно 15. Для найденного значения x вычислите частное от деления значения арифметического выражения на 15 и укажите его в ответе в десятичной системе счисления. Основание системы счисления в ответе указывать не нужно.",
            "expected_output": "77888"
        },
        "9": {
            "description": "Операнды арифметического выражения записаны в системах счисления с основаниями 22 и 13. x23x5[22] – 67y9y[13] В записи чисел переменными x и y обозначены неизвестные значащие цифры из алфавитов 22-ричной и 13-ричной систем счисления соответственно. Определите значения x, y, при которых значение данного арифметического выражения кратно 57. Для найденных значений x, y вычислите частное от деления значения арифметического выражения на 57 и укажите его в ответе в десятичной системе счисления. Если можно выбрать x, y не единственным образом, возьмите ту пару, в которой сумма значений x и y меньше. Основание системы счисления в ответе указывать не нужно.",
            "expected_output": "25871"
        },
        "10": {
            "description": "Определите число N, для которого выполняется равенство 123[N] = 93[N+2].",
            "expected_output": "9"
        },
        "11": {
            "description": "Определите число N, для которого выполняется равенство 205[N] + 55[8] = 196[N+2].",
            "expected_output": "11"
        },
        "12": {
            "description": "В некоторой системе счисления записи десятичных чисел 56 и 45 заканчиваются на 1. Определите основание системы счисления.",
            "expected_output": "11"
        },
        "13": {
            "description": "Запись числа 338 в системе счисления с основанием N содержит 3 цифры и оканчивается на 2. Чему равно максимально возможное основание системы счисления?",
            "expected_output": "16"
        },
        "14": {
            "description": "Сколько существует чисел, не превосходящих 50, запись которых в троичной системе счисления оканчивается на 21?",
            "expected_output": "5"
        },
        "15": {
            "description": "Сколько существует чисел, не превосходящих 100, запись которых в шестнадцатеричной системе счисления оканчивается на С?",
            "expected_output": "6"
        },
        "16": {
            "description": "Запишите натуральное число, десятичная запись которою состоит из двух цифр, шестнадцатеричная запись заканчивается цифрой А, а пятеричная цифрой 3.",
            "expected_output": "58"
        },
        "17": {
            "description": "Запись числа N в системе счисления с основанием 3 содержит четыре цифры, запись этого числа в системе счисления с основанием 7 содержит три цифры, а запись в системе счисления с основанием 8 заканчивается на 17. Чему равно N? Запишите ответ в десятичной системе счисления.",
            "expected_output": "79"
        }
    }
}
