{
  "tasks": {
    "№14": {
      "1": {
        "description": "Значение выражения 7^103 + 20∙7^104 – 3∙7^57 + 97 записали в системе счисления с основанием 7. Сколько цифр 6 содержится в этой записи?",
        "expected_output": "48"
      },
      "2": {
        "description": "Значение выражения 7^103 + 6∙7^104 – 3∙7^57 + 98 записали в системе счисления с основанием 7. Найдите сумму цифр получишегося числа в 10 с.с.",
        "expected_output": "282"
      },
      "3": {
        "description": "Значение выражения 6^203 + 5∙6^405 – 3∙6^144 + 76 записали в системе счисления с основанием 6. Найдите разницу в кол-ве пятерок и нулей.",
        "expected_output": "285"
      },
      "4": {
        "description": "Значение арифметического выражения 17^5 + 85^8 – 10 записали в системе счисления с основанием 17. В этой записи помимо цифр от 0 до 9 могут встречаться цифры из списка: А, B, С, D, E, F, G, которые имеют числовые значения от 10 до 16 соответственно. Сколько цифр G встречается в этой записи?",
        "expected_output": "5"
      },
      "5": {
        "description": "Значение арифметического выражения 7^2 + 49^4 - 21 записали в системе счисления с основанием 14. В этой записи помимо цифр от 0 до 9 могут встречаться цифры из списка: А, B, С, D, которые имеют числовые значения от 10 до 13 соответственно. Сколько цифр A и цифр 0 встречается в этой записи?",
        "expected_output": "3"
      },
      "6": {
        "description": "При каком наименьшем натуральном значении переменной x в выражении 81^20 – 9^x + 50 сумма цифр в девятеричной записи числа равна 138?",
        "expected_output": "24"
      },
      "7": {
        "description": "Значение выражения 64^12 – 8^14 + x записали в восьмеричной системе счисления, при этом в записи оказалось 12 цифр 7 и одна единица. При каком наименьшем натуральном x это возможно?",
        "expected_output": "127"
      },
      "8": {
        "description": "Операнды арифметического выражения записаны в системе счисления с основанием 18: 9009x₁₈ + 2257x₁₈ В записи чисел переменной x обозначена неизвестная цифра из алфавита 18-ричной системы счисления. Определите наименьшее значение x, при котором значение данного арифметического выражения кратно 15. Для найденного значения x вычислите частное от деления значения арифметического выражения на 15 и укажите его в ответе в десятичной системе счисления. Основание системы счисления в ответе указывать не нужно.",
        "expected_output": "77888"
      },
      "9": {
        "description": "Операнды арифметического выражения записаны в системах счисления с основаниями 22 и 13. x23x5[22] – 67y9y[13] В записи чисел переменными x и y обозначены неизвестные значащие цифры из алфавитов 22-ричной и 13-ричной систем счисления соответственно. Определите значения x, y, при которых значение данного арифметического выражения кратно 57. Для найденных значений x, y вычислите частное от деления значения арифметического выражения на 57 и укажите его в ответе в десятичной системе счисления. Если можно выбрать x, y не единственным образом, возьмите ту пару, в которой сумма значений x и y меньше. Основание системы счисления в ответе указывать не нужно.",
        "expected_output": "25871"
      },
      "10": {
        "description": "Определите число N, для которого выполняется равенство 123[N] = 93[N+2].",
        "expected_output": "9"
      },
      "11": {
        "description": "Определите число N, для которого выполняется равенство 205[N] + 55[8] = 196[N+2].",
        "expected_output": "11"
      },
      "12": {
        "description": "В некоторой системе счисления записи десятичных чисел 56 и 45 заканчиваются на 1. Определите основание системы счисления.",
        "expected_output": "11"
      },
      "13": {
        "description": "Запись числа 338 в системе счисления с основанием N содержит 3 цифры и оканчивается на 2. Чему равно максимально возможное основание системы счисления?",
        "expected_output": "16"
      },
      "14": {
        "description": "Сколько существует чисел, не превосходящих 50, запись которых в троичной системе счисления оканчивается на 21?",
        "expected_output": "5"
      },
      "15": {
        "description": "Сколько существует чисел, не превосходящих 100, запись которых в шестнадцатеричной системе счисления оканчивается на С?",
        "expected_output": "6"
      },
      "16": {
        "description": "Запишите натуральное число, десятичная запись которою состоит из двух цифр, шестнадцатеричная запись заканчивается цифрой А, а пятеричная цифрой 3.",
        "expected_output": "58"
      },
      "17": {
        "description": "Запись числа N в системе счисления с основанием 3 содержит четыре цифры, запись этого числа в системе счисления с основанием 7 содержит три цифры, а запись в системе счисления с основанием 8 заканчивается на 17. Чему равно N? Запишите ответ в десятичной системе счисления.",
        "expected_output": "79"
      }
    },
    "№2": {
      "1": {
        "description": "Задача № 1 из файла info2v",
        "expected_output": "zyx"
      },
      "2": {
        "description": "Задача № 2 из файла info2v",
        "expected_output": "yxwz"
      },
      "3": {
        "description": "Задача № 3 из файла info2v",
        "expected_output": "wxyz"
      },
      "4": {
        "description": "Задача № 4 из файла info2v",
        "expected_output": "ctab"
      },
      "5": {
        "description": "Задача № 5 из файла info2v",
        "expected_output": "yxwz"
      },
      "6": {
        "description": "Задача № 6 из файла info2v",
        "expected_output": "xwyz"
      },
      "7": {
        "description": "Задача № 7 из файла info2v",
        "expected_output": "yzxw"
      },
      "8": {
        "description": "Задача № 8 из файла info2v",
        "expected_output": "zxyw"
      },
      "9": {
        "description": "Задача № 9 из файла info2v",
        "expected_output": "12"
      }
    },
	 "№15": {
       "1": {
        "description": "Обозначим через ДЕЛ(n, m) утверждение «натуральное число n делится без остатка на натуральное число m». Для какого наименьшего натурального числа A формула ДЕЛ(A, 9) ∧ (ДЕЛ(280, x) → (¬ДЕЛ(A, x) → ¬ДЕЛ(730, x))) тождественно истинна, то есть принимает значение 1 при любом натуральном x?",
        "expected_output": "90"
    },
    "2": {
        "description": "Обозначим через ДЕЛ(n, m) утверждение «натуральное число n делится без остатка на натуральное число m». Для какого наименьшего натурального числа А формула (ДЕЛ(x, 34) ∧ ¬ДЕЛ(x, 51)) → (¬ДЕЛ(x, A) ∨ ДЕЛ(x, 51)) тождественно истинна (то есть принимает значение 1 при любом натуральном значении переменной х)?",
        "expected_output": "3"
    },
    "3": {
        "description": "Обозначим через ДЕЛ(n, m) утверждение «натуральное число n делится без остатка на натуральное число m». Для какого наибольшего натурального числа A формула ((ДЕЛ(x, 36) ∧ ДЕЛ(x, 42)) → ДЕЛ(x, A)) ∧ ( A⋅(A – 25) < 25⋅ (A + 200)) тождественно истинна (то есть принимает значение 1 при любом натуральном значении переменной х)?",
        "expected_output": "84"
    },
    "4": {
        "description": "Определите наименьшее натуральное число A, такое что выражение (X & 41 = 0) → ((X & 119 ≠ 0) → (X & A ≠ 0)) тождественно истинно (то есть принимает значение 1 при любом натуральном значении переменной X)?",
        "expected_output": "86"
    },
    "5": {
        "description": "Определите наименьшее натуральное число A, такое что выражение (( (X & 13 ≠  0) ∨ (X & A = 0)) → (X & 13 ≠ 0)) ∨  (X & A ≠ 0) ∨ (X & 39 = 0) тождественно истинно (то есть принимает значение 1 при любом натуральном значении переменной X)?",
        "expected_output": "34"
    },
    "6": {
        "description": "Определите наименьшее натуральное число A, при котором выражение (x & A = 0) ∧ (x & 41 ≠ 0) ∧ (x & 33 =  0) тождественно ложно (то есть принимает значение 0 при любом натуральном значении переменной x)?",
        "expected_output": "8"
    },
    "7": {
        "description": "Определите наибольшее натуральное число A из интервала [43, 55] такое, что выражение ((x & 17  ≠ 0) → ((x & A ≠ 0) → (x & 58 ≠ 0))) → ((x & 8  = 0) ∧ (x & A ≠ 0) ∧ (x & 58  =  0)) тождественно ложно (то есть принимает значение 0 при любом натуральном значении переменной x)?",
        "expected_output": "50"
    },
    "8": {
        "description": "Укажите наименьшее целое значение А, при котором выражение (y + 3x < A) ∨ (x > 20) ∨ (y > 40) истинно для любых целых положительных значений x и y.",
        "expected_output": "101"
    },
    "9": {
        "description": "Укажите наименьшее целое значение А, при котором выражение (2y + 3x < A) ∨ (x + y > 40) истинно для любых целых неотрицательных значений x и y.",
        "expected_output": "121"
    },
    "10": {
        "description": "Для какого наибольшего целого неотрицательного числа А выражение (220 ≠ y + 2x + z) ∨ (A < 6x) ∨ (A < y) ∨ (A < 2z) истинно при любых целых неотрицательных x, y, z?",
        "expected_output": "119"
    },
    "11": {
        "description": "Сколько существует различных комбинаций неотрицательных целых значений x и y, при которых истинно выражение ¬( ((x > 6) ∧ ((x + y) ≥ 5)) ∨  (y ≥ 5) )",
        "expected_output": "35"
    },
    "12": {
        "description": "Элементами множества A являются натуральные числа. Известно, что выражение (x ∈ {2, 4, 6, 8, 10, 12}) → (((x ∈ {3, 6, 9, 12, 15}) ∧ ¬(x ∈ A)) → ¬(x ∈ {2, 4, 6, 8, 10, 12})) истинно при любом значении переменной x. Определите наименьшее возможное значение суммы элементов множества A.",
        "expected_output": "18"
    },
    "12.1": {
        "description": "Элементами множеств А, P, Q являются натуральные числа, причём P={1,3,4,9,11,13,15,17,19,21}, Q={3,6,9,12,15,18,21,24,27,30}. Известно, что выражение ((x ∈ P) → (x ∈ A)) ∨ ((x ∉ A) → (x ∉ Q)) истинно (т.е. принимает значение 1 при любом значении переменной х. Определите наименьшее возможное количество элементов в множестве A.",
        "expected_output": "4"
    },
    "13": {
        "description": "Элементами множества A являются натуральные числа. Известно, что выражение ¬(x ∈ {2, 4, 6, 8, 10, 12}) ∨ (¬(x ∈ {3, 6, 9, 12, 15}) → (x ∈ A)) истинно при любом значении переменной x. Определите наименьшее возможное значение произведения элементов множества A.",
        "expected_output": "640"
    },
    "14": {
        "description": "Элементами множеств A, P и Q являются натуральные числа, причём P = {2, 4, 6, 8, 10, 12, 14, 16, 18, 20}, Q = {5, 10, 15, 20, 25, 30, 35, 40, 45, 50}. Известно, что выражение ((x ∈ A) → (x ∈ P)) ∧ ((x ∈ Q) → ¬(x ∈ A)) истинно при любом значении переменной x. Определите наибольшее возможное количество элементов множества A.",
        "expected_output": "8"
    },
    "14.2": {
        "description": "Элементами множеств А, P и Q являются натуральные числа, причём  P={2, 4, 6, 8, 10, 12, 14, 16, 18, 20} и Q={5, 10, 15, 20, 25, 30, 35, 40, 45, 50}. Известно, что выражение ((x ∈ A) → (x ∈ P)) ∨ (¬(x ∈ Q) → ¬(x ∈ A)) истинно (т.е. принимает значение 1 при любом значении переменной х. Определите наибольшее возможное количество элементов в множестве A.",
        "expected_output": "18"
    },
    "15": {
        "description": "Пусть P – множество всех 8-битовых цепочек, начинающихся с 11, Q – множество всех 8-битовых цепочек, оканчивающихся на 0, а A – некоторое множество произвольных 8-битовых цепочек. Сколько элементов содержит минимальное множество A, при котором для любой 8-битовой цепочки x истинно выражение ¬(x ∈ A) → (¬(x ∈ P) ∧ ¬(x ∈ Q))",
        "expected_output": "160"
    },
    "16": {
        "description": "На числовой прямой даны два отрезка: P = [25; 50], Q = [54; 75]. Найдите наименьшую возможную длину отрезка A, при котором формула (x ∈ Q) → (((x ∈ P) ≡ (x ∈ Q)) ∨ (¬(x ∈ P) → (x ∈ A))) тождественно истинна, то есть принимает значение 1 при любом значении переменной x.",
        "expected_output": "21"
    },
    "17": {
        "description": "На числовой прямой даны два отрезка: P = [25, 37] и Q = [32, 50]. Отрезок A таков, что формула ((x ∈ A) ∧ ¬(x ∈ Q)) → ((x ∈ P) ∨ (x ∈ Q)) тождественно истинна. Какова наибольшая возможная длина отрезка A?",
        "expected_output": "25"
    },
	"18": {
    "description": "На числовой прямой даны три отрезка: P = [5, 100], Q = [15, 25] и R = [35, 50]. Найдите наименьшую возможную длину отрезка A, при котором формула ((x ∈ P) → (x ∈ Q)) ∨ (¬(x ∈ A) → (x ∈ R)) тождественно истинна.",
    "expected_output": "95"
		},
		"19": {
    "description": "На числовой прямой даны три отрезка: P = [5, 20], Q = [15, 25] и R = [35, 50]. Найдите наименьшую возможную длину отрезка A, при котором формула ((x ∈ P) → (x ∈ Q)) ∨ (¬(x ∈ A) → ¬(x ∈ R)) тождественно истинна.",
    "expected_output": "0"
  },
  "20": {
    "description": "На числовой прямой даны два отрезка: P = [25; 50], Q = [54; 75]. Найдите наименьшую возможную длину отрезка A, при котором формула (x ∈ Q) → (((x ∈ P) ≡ (x ∈ Q)) ∨ (¬(x ∈ P) → (x ∈ A))) тождественно истинна, то есть принимает значение 1 при любом значении переменной x.",
    "expected_output": "25"
  }
    },
  "№13": {
    "2": {
      "description": "Для узла с IP-адресом 220.128.112.142 адрес сети равен 220.128.96.0. Чему равен третий слева байт маски? Ответ запишите в виде десятичного числа.",
      "expected_output": "224"
    },
    "3": {
      "description": "Для узла с IР-адресом 111.81.208.27 адрес сети равен 111.81.192.0. Чему равно наименьшее возможное значение третьего слева байта маски? Ответ запишите в виде десятичного числа.",
      "expected_output": "192"
    },
    "4": {
      "description": "Для узла с IP-адресом 148.195.140.28 адрес сети равен 148.195.140.0. Найдите наименьшее возможное количество единиц в двоичной записи маски подсети.",
      "expected_output": "22"
    },
    "5": {
      "description": "Для узла с IP-адресом 241.185.253.57 адрес сети равен 241.185.252.0. Найдите наименьшее возможное количество нулей в двоичной записи маски подсети.",
      "expected_output": "9"
    },
    "6": {
      "description": "Для узла с IР-адресом 76.155.48.2 адрес сети равен 76.155.48.0. Для скольких различных значений маски это возможно?",
      "expected_output": "11"
    },
    "7": {
      "description": "Два узла, находящиеся в одной сети, имеют IР-адреса 112.117.107.70 и 112.117.121.80. Укажите наибольшее возможное значение третьего слева байта маски сети. Ответ запишите в виде десятичного числа.",
      "expected_output": "224"
    },
    "8": {
      "description": "Два узла, находящиеся в разных подсетях, имеют IР-адреса 157.127.182.76 и 157.127.190.80. В масках обекх подсетей одинаковое количество единиц. Укажите наименьшее возможное количество единиц в масках этих подсетей.",
      "expected_output": "21"
    },
    "9": {
      "description": "Для некоторой подсети используется маска 255.255.254.0. Сколько различных адресов компьютеров теоретически допускает эта маска, если два адреса (адрес сети и широковещательный) не используют?",
      "expected_output": "510"
    },
    "10": {
      "description": "Для узла с IР-адресом 108.133.75.91 адрес сети равен 108.133.75.64. Чему равно наибольшее количество возможных адресов в этой сети?",
      "expected_output": "64"
    },
    "11": {
      "description": "Для узла с IP-адресом 175.122.80.13 адрес подсети равен 175.122.80.0. Сколько существует различных возможных значений маски, если известно, что в этой сети не менее 60 узлов? Ответ запишите в виде десятичного числа.",
      "expected_output": "7"
    },
    "12": {
      "description": "Сеть задана IP-адресом 184.178.54.144 и маской сети 255.255.255.240. Сколько в этой сети IP-адресов. у которых в двоичной записи IP-адреса имеется сочетание трех подряд идущих единиц? В ответе укажите только число.",
      "expected_output": "16"
    },
    "12.1": {
      "description": "Сеть задана IP-адресом 172.16.168.0 и маской сети 255.255.248.0. Сколько в этой сети IP-адресов, для которых количество единиц в двоичной записи IP-адреса не кратно 5?",
      "expected_output": "1663"
    },
    "13": {
      "description": "Сеть задана IP-адресом 211.48.136.64 и маской сети 255.255.255.224. Сколько в этой сети IP-адресов, которые в двоичной записи IP-адреса оканчиваются двумя единицами? В ответе укажите только число.",
      "expected_output": "8"
    },
    "14": {
      "description": "Если маска подсети 255.255.255.240 и IP адрес компьютера в сети 192.168.156.235, то чему будет равен номер компьютера в сети?",
      "expected_output": "11"
    },
    "15": {
      "description": "Некоторая сеть имеет маску 255.255.128.0. Сколько в этой сети IP-адресов, для которых числовое значение четырёхбайтного IP-адреса кратно четырём?",
      "expected_output": "8192"
    },
    "16": {
      "description": "Для узла с IP-адресом 238.237.149.255 адрес сети равен 238.237.148.0. Каково наибольшее возможное количество единиц в двоичной записи маски? В ответе укажите только число.",
      "expected_output": "22"
    },
    "17": {
      "description": "Два узла, находящиеся в разных подсетях, имеют IP-адреса 118.187.59.255 и 118.187.65.115. В масках обеих подсетей одинаковое количество единиц. Укажите наибольшее возможное количество единиц в масках этих подсетей. Учтите, что два адреса в любой подсети зарезервированы: адрес всей подсети и широковещательный адрес.",
      "expected_output": "21"
    }
  }


  },
  "contask": {
    "1": {
      "description": "Определите количество 9-⁠ричных 6-⁠значных чисел, которые не начинаются с нечетных цифр, не оканчиваются цифрами 2 или 3, содержат не менее двух цифр 1."
    },
	"2": {
      "description": "Определите количество цифр с числовым значением, превышающим 9, в 27-⁠ричной записи числа, заданного выражением: 2 · 729^2014 + 2 · 81^2018 + 2 · 27^2020 − 2 · 9^2022 − 2024"
    },
	"3": {
      "description": "Значение арифметического выражения 6^2030 + 6^100 – х, где х – целое положительное число, не превышающее 2030, записали в 6-ричной системе счисления. Определите наибольшее количество нулей, которое может содержать число, являющееся 6-ричной записью значения данного арифметического выражения."
    },
	"4": {
      "description": "Логическая функция F задаётся выражением ¬(x → z) ˅ (y ≡ w) ˅ y. На рисунке приведён частично заполненный фрагмент таблицы истинности функции F, содержащий неповторяющиеся строки. Определите, какому столбцу таблицы истинности функции F соответствует каждая из переменных x, y, z, w.",
            "image": "imgs/7533.gif"
	},
	"5": {
      "description": "Обозначим через m & n поразрядную конъюнкцию неотрицательных целых чисел m и n. Например, 14 & 5 = 11102 & 01012 = 01002 = 4. Для какого наименьшего натурального числа А формула (x & 3582 = 0) → ((x & 4531 ≠ 0) → (x & A ≠ 0)) тождественно истинно (то есть принимает значение 1 при любом натуральном значении переменной X)?"
    },
	"6": {
      "description": "На числовой прямой даны три отрезка: P = [131; 215], Q = [36; 384] и R = [243; 355]. Укажите наименьшую возможную длину такого отрезка A, что формула (¬((x ∈ Q) → ((x ∈ P) ∨ (x ∈ R)))) → (¬(x ∈ A) → ¬(x ∈ Q)) тождественно истинна, то есть принимает значение 1 при любом значении переменной х?"
    }
	
	
  }
}